# команды и менеджеры — редактируй под себя
TEAMS = {
    1:  {
        "members": {
            775766895: "Кирилл Востриков",
            731869173: "Татьяна Воронкова",
            368455189: "Наталья Голощапова",
            949507228: "Марьяна Попова",
            220691670: "Алексей Хван",
            1348645453: "Виктория Моисеенко",
            168099024: "Айрат Каримов",
            946740162: "Александр Зайцев"
        },
        # можно один или несколько
        "managers": [728631150, 775766895]
    },
    2: {
        "members": {
            1010954244: "Константин Базаркин",
            398995895: "Антон Баронин",
            1038645944: "Андрей Часов",
            253240597: "Дмитрий Малютин",
            32063968:  "Радмир Рахманкулов"
        },
        "managers": [185065172, 775766895]
    }
}

# удобный плоский словарь chat_id -> имя
USERS = {}
for team in TEAMS.values():
    USERS.update(team["members"])